package type;

public class Ex04 {
	public static void main(String[] args) {
		// 컴퓨터가 처리하는 가장 단순한 형태의 데이터 : 정수
		// 정수를 비롯하여 사람들이 많이 쓰는 자료형의 집합 : Primitive type
		// 정수, 실수, 논리값
		
		// + 문자열
		
		// 이런 자료형들을 이용하여 개별 데이터를 저장하기 위한 메모리 공간 : 변수
		// 변수는 하나의 데이터밖에 저장할 수 없다.
		// 여러 데이터를 저장하기 위한 기초 자료형 : 배열
		
		// 배열은 같은 자료형의 여러 데이터를 묶어서 관리할 수 있다.
		
		// 그러나, 현실의 여러 유형의 요소(객체)들은 하나의 자료형만으로 정의하기 힘들다.
		// 이름은 문자열, 나이는 정수 등등...
		
		// 따라서 서로 다른 자료형의 데이터들을 묶어서 하나의 형태를 나타내기 위한 문법이 필요하다.
		
		// C언어에서는 구조체라는 형식으로 서로 다른 자료형을 묶어서 새로운 자료형을 만들 수 있다.
		
		// 구조체 : 서로다른 자료형의 여러 변수를 묶어서 만드는 사용자 정의 자료형
		
		// 구조체는 변수만 묶어서 관리할 수 있다.
		// 하지만, 자료형이 새로 만들어지면, 그와 작용하는 코드(함수)도 형태가 바뀐다.
		// 특정 구조체는 특정 함수와 연계하여 작동한다.
		
		// 어차피 같이 묶어서 가져다닌다면, 처음부터 하나로 합치는 것이 효율적이다.
		
		// 클래스 : 여러 변수 + 여러 함수를 포함하는 자료형
		// 클래스의 구성 요소 : 변수, 함수, 생성자, 접근 제한자
		
	}
}
